Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum
Polymesh check error code, consistent with toolkits geometry::geoPolymeshStatus_e

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.PolymeshUndefined
Polymesh null, creation failed or unknown reasons.

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexArrayInnerloop
Check of indices of vertices in innerloop failed

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.InnerloopNotInsideOuterloop
Inner loop is not inside outer loop

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.SelfIntersectingOuterloop
Outer loop is self intersecting

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.SelfIntersectingInnerloop
Inner loop is self intersecting

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.MultishellPolymesh
Polymesh consists of multi shells

Tekla.Structures.Model.Polymesh.PolymeshHealthCheckEnum.VertexArrayUniqueness
Vertex array does not contain unique vertices